# This notebook is about the very basics of Microsoft T-SQL.

#### e.g. 1: while loop, try& catch

```SQL

Declare @x int,
        @s int

		set @x=1
		set @s=0

		while(@x<=10)
		    begin
				set @s=@s+@x
				set @x=@x+1
			end
		select 'the answer= '+ convert(varchar(3),@s)  --use varchar to convert a variable to a string

begin try
	select 1/0
end try
begin catch -- question: which exception to catch? In this way, all kinds of exceptions will be catched?
	select 'Exception! The denominator is zero!'  
end catch
```

#### e.g.2 login via entrusted windows local account

```SQL
C:\Users\Student>sqlcmd -E -dDB01
1> select * from student
2> gi
3> go
id          name                 bdate            tel
----------- -------------------- ---------------- --------------------
        101 Geisel                     1980-08-08 012355
        102 Schlachter                 1980-08-01 012350

(2 個受影響的資料列)
```

#### e.g. 3 login via user name & password

```SQL
C:\Users\Student>sqlcmd -Usa -PP@ssw0rd -dDB01
1> select * from student
2> go
id          name                 bdate            tel
----------- -------------------- ---------------- --------------------
        101 Geisel                     1980-08-08 012355
        102 Schlachter                 1980-08-01 012350

(2 個受影響的資料列)
```

#### e.g. 4 covers

#### I) login via user name &password: specify an SQL server

#### II) use select  to select specific columns

```SQL
C:\Users\Student>sqlcmd -Usa -PP@ssw0rd -dDB01 -s localhost:12321
1> select * from student
2> go
id         lname                lbdate           ltel
-----------l--------------------l----------------l--------------------
        101lGeisel              l      1980-08-08l012355
        102lSchlachter          l      1980-08-01l012350

(2 個受影響的資料列)
1>
2>
3> select [name][id] from student   --this is wrong. I should add a comma between [name] and [id]
4> go
id
--------------------
Geisel
Schlachter

(2 個受影響的資料列)
1> select [name],[id]  from student
2> go
name                lid
--------------------l-----------
Geisel              l        101
Schlachter          l        102

(2 個受影響的資料列)
```